SET NAMES UTF8;

DROP DATABASE IF EXISTS cake;

CREATE DATABASE cake CHARSET=UTF8;

USE cake;

/*蛋糕种类*/
CREATE TABLE cake_laptop_family(
	fid INT PRIMARY KEY AUTO_INCREMENT,
  
	fname VARCHAR(32)
);

/*商品--蛋糕*/
CREATE TABLE cake_laptop(
	 lid INT PRIMARY KEY AUTO_INCREMENT, #ID
	 cake_id INT,	#所属种类家族编号  
	 lname VARCHAR(32),          #商品名称
	 short_detail VARCHAR(128),   #商品简介
	 details VARCHAR(10024),     #产品详细说明
	 price DECIMAL(10,2),       #价格
	 old_price DECIMAL(10,2),    #旧的价格
	 sold_count INT,             #已售出的数量
     ratings INT,                #好评率
	 cake_image VARCHAR(128)    #蛋糕图片
);

/*蛋糕评论*/

CREATE TABLE cake_rating(
	rid INT PRIMARY KEY AUTO_INCREMENT,
	c_id INT, #所属蛋糕的评论
	rat_ratings VARCHAR(10024) #蛋糕评论
	
);

/*用户信息*/
CREATE TABLE cake_user(
	uid  INT  PRIMARY KEY AUTO_INCREMENT,
	uname VARCHAR(32) UNIQUE, #用户名 
	upwd VARCHAR(32)NOT NULL , #密码
	email VARCHAR(64) NOT NULL , #邮箱
	phone VARCHAR(16) NOT NULL , #手机号
	user_name VARCHAR(32),      #用户姓名
	gender INT   default null           #性别  0-女  1-男
);

/*收货地址信息*/
CREATE TABLE cake_receiver_address(
	 aid INT PRIMARY KEY AUTO_INCREMENT, #ID 
	 user_id INT,                #用户编号
	 receiver VARCHAR(16),       #接收人姓名
	 province VARCHAR(16),       #省
	 city VARCHAR(16),           #市
	 county VARCHAR(16),         #县
	 address VARCHAR(128),       #详细地址
	 cellphone VARCHAR(16),      #手机
	
	  is_default BOOLEAN          #是否为当前用户的默认收货地址
	);





/*************/
/******数据导入*******/
/*************/
/******蛋糕种类家族*******/
INSERT INTO cake_laptop_family VALUES
(NULL,'鲜奶蛋糕'),
(NULL,'水果蛋糕'),
(NULL,'巧克力蛋糕'),
(NULL,'慕斯蛋糕'),
(NULL,'无糖蛋糕'),
(NULL,'数码蛋糕'),
(NULL,'冰激凌蛋糕'),
(NULL,'黑森林蛋糕'),
(NULL,'榴莲千层');

/*商品-蛋糕*/
INSERT INTO cake_laptop VALUES
(NULL,1,'往后余生相濡以沫','新鲜制作，同城配送，最快俩小时送达！','鲜奶草莓蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',199,239,109,87,'1.jpg'),
(NULL,1,'冰雪奇缘公主蛋糕','新鲜制作，同城配送，最快俩小时送达！','鲜奶网红蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',259,309,765,98,'2.jpg'),
(NULL,1,'缤纷年华','新鲜制作，同城配送，最快俩小时送达！','鲜奶网红蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',79,109,965,96,'3.jpg'),
(NULL,1,'七彩虹','新鲜制作，同城配送，最快俩小时送达！','鲜奶网红蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',109,129,897,89,'4.jpg'),
(NULL,1,'甜蜜物语','新鲜制作，同城配送，最快俩小时送达！','鲜奶网红蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',123,150,665,78,'5.jpg'),
(NULL,1,'米洛洛','新鲜制作，同城配送，最快俩小时送达！','鲜奶网红蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',89,109,309,99,'6.jpg'),
(NULL,2,'娜爱丝甜品','新鲜制作，同城配送，最快俩小时送达！','水果蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',139,209,867,87,'7.jpg'),
(NULL,2,'新味觉','新鲜制作，同城配送，最快俩小时送达！','水果蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',97,149,967,78,'8.jpg'),
(NULL,2,'彩虹西饼','新鲜制作，同城配送，最快俩小时送达！','水果蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',120,200,867,89,'9.jpg'),
(NULL,2,'梦幻天使','新鲜制作，同城配送，最快俩小时送达！','水果蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',99,199,567,93,'10.jpg'),
(NULL,3,'巧克力森林','新鲜制作，同城配送，最快俩小时送达！','巧克力蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',199,259,967,94,'11.jpg'),
(NULL,3,'雅米蛋糕','新鲜制作，同城配送，最快俩小时送达！','巧克力蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',105,159,467,89,'12.jpg'),
(NULL,3,'黑色甜蜜','新鲜制作，同城配送，最快俩小时送达！','巧克力蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',69,99,678,78,'13.jpg'),
(NULL,4,'美之旋律','新鲜制作，同城配送，最快俩小时送达！','慕斯蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',98,159,367,87,'14.jpg'),
(NULL,4,'悉尼之风','新鲜制作，同城配送，最快俩小时送达！','慕斯蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',73,129,400,99,'15.jpg'),
(NULL,4,'尼斯湖的秘密','新鲜制作，同城配送，最快俩小时送达！','慕斯蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',80,120,567,97,'16.jpg'),
(NULL,5,'纯色之冬','新鲜制作，同城配送，最快俩小时送达！','无糖蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',67,109,400,80,'17.jpg'),
(NULL,5,'秘密城堡','新鲜制作，同城配送，最快俩小时送达！','无糖蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',78,110,578,98,'18.jpg'),
(NULL,6,'蜜桃星球','新鲜制作，同城配送，最快俩小时送达！','数码蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',67,90,677,90,'19.jpg'),
(NULL,6,'晴朗夏日','新鲜制作，同城配送，最快俩小时送达！','数码蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',89,153,555,90,'20.jpg'),
(NULL,6,'嫣然淑女','新鲜制作，同城配送，最快俩小时送达！','数码蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',69,119,666,89,'21.jpg'),
(NULL,6,'梦幻的夜','新鲜制作，同城配送，最快俩小时送达！','数码蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',99,159,789,98,'22.jpg'),
(NULL,7,'绿之流水','新鲜制作，同城配送，最快俩小时送达！','冰激凌蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',109,179,999,91,'23.jpg'),
(NULL,7,'巴厘岛之恋','新鲜制作，同城配送，最快俩小时送达！','冰激凌蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',123,159,567,87,'24.jpg'),
(NULL,7,'鲜果塔','新鲜制作，同城配送，最快俩小时送达！','冰激凌蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',110,179,889,80,'25.jpg'),
(NULL,8,'黑月亮','新鲜制作，同城配送，最快俩小时送达！','黑森林蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',89,149,700,90,'26.jpg'),
(NULL,8,'焦糖小碗','新鲜制作，同城配送，最快俩小时送达！','黑森林蛋糕甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',79,159,888,99,'27.jpg'),
(NULL,9,'榴莲千层','新鲜制作，同城配送，最快俩小时送达！','榴莲千层甄选优质低筋小麦面粉、农家散养笨鸡蛋，专业制作，新鲜的食材，纯正的蛋糕师多年的经验调试出口感和甜度适宜的产品，当天制作，专人配送',129,259,1099,93,'28.jpg');


INSERT INTO cake_rating VALUES
(NULL,1,'用勺子bai轻轻挖下一块带着草莓奶油的蛋糕，放入口中，根本不用嚼，含在口中一会儿就化掉了，唇齿间留下一丝淡淡的清香。细细回味，奶油浓浓的气息回旋在口中，甜甜的，香香的。'),
(NULL,2,'入口时嫩嫩的，香气扑鼻，滑滑的栗子顺着奶油一下子就吞了进去，甜丝丝的奶油丝毫不滑腻，微微的甜，谁尝了，都绝对会忍不住吃上第二口。'),
(NULL,2,'蛋糕店的老板很用心，不光亲自把蛋糕送到家里，而且蛋糕的造型也非常的可爱，家中的小孩和老人都很喜欢'),
(NULL,3,'中午想吃点甜点，所以选择了这家的蛋糕，抱着试试的想法下了单，没想到送来的时候尺寸很大并且味道也很好，两个人都没有吃完'),
(NULL,4,'太赞啦！蛋糕很松软，奶油味浓浓的超棒！'),
(NULL,5,'超好吃，下次还来买'),
(NULL,6,'再次回购这款蛋糕，奶油不腻，蛋糕上面的水果也很新鲜，并且蛋糕的量和尺寸也不小，很满意的一次消费体验'),
(NULL,6,'很棒的一款蛋糕，水果的分量很足，蛋糕的品质也很好，不是那种酸酸的草莓，并且蛋糕上面的蓝莓和哈密瓜也很新鲜'),
(NULL,8,'很喜欢水果蛋糕上面的那些水果，但是上面的奶油也非常好吃，口感很好，家里的孩子们都挺喜欢吃的'),
(NULL,9,'超好吃'),
(NULL,7,'蛋糕店的老板很用心'),
(NULL,10,'谁尝了，都绝对会忍不住吃上第二口'),
(NULL,11,'甜甜的，香香的'),
(NULL,10,'很喜欢这款黑森林蛋糕，不仅里面有巧克力夹心，并且上面的奶油吃上去非常的香甜，同时也不会感觉到奶油的油腻'),
(NULL,12,'蛋糕做起来挺快的，并且样子也非常的漂亮，尤其是蛋糕上面的皇冠造型让人看上去就会忍不住想要吃上一口'),
(NULL,11,'口感很好，家里的孩子们都挺喜欢吃的'),
(NULL,13,'很满意的一次消费体验'),
(NULL,14,'把一大勺慕斯蛋糕塞入口中，冰凉的奶油一下子就化成了暖暖的，带有淡淡乳酪香味的蛋糕底十分诱人，软软的蛋糕中夹着甜蜜的鲜奶油，真是美味至极啊。'),
(NULL,13,'带有淡淡乳酪香味的蛋糕底十分诱人'),
(NULL,15,'再次回购这款蛋糕,味道和以前一样好'),
(NULL,3,'顺着奶油一下子就吞了进去，丝滑柔顺'),
(NULL,15,'微微的甜，谁尝了，都绝对会忍不住吃上第二口'),
(NULL,16,'外观唯美，很不错的一款蛋糕'),
(NULL,16,'微甜，谁尝了，都绝对会忍不住吃上第二口'),
(NULL,18,'挺划算的，也好吃'),
(NULL,19,'谁尝了，都绝对会忍不住吃上第二口'),
(NULL,20,'谁尝了，都绝对会忍不住吃上第二口'),
(NULL,21,'中午想吃点甜点，所以选择了这家的蛋糕，抱着试试的想法下了单，没想到送来的时候尺寸很大并且味道也很好，两个人都没有吃完'),
(NULL,26,'蛋糕的量和尺寸也不小，很满意的一次消费体验');




/*用户信息*/
INSERT INTO cake_user VALUES
(NULL, 'dingding', '12345678', 'ding@qq.com', '13501234567',  '丁伟', '1'),
(NULL, 'dangdang', '12345678', 'dang@qq.com', '13501234568',  '林当', '1'),
(NULL, 'doudou', '12345678', 'dou@qq.com', '13501234569',  '窦志强', '1'),
(NULL, 'yaya', '12345678', 'ya@qq.com', '13501234560', '秦小雅', '0');
